In [7]:
import pandas as pd
import sqlite3
import os

In [8]:
os.getcwd()

'c:\\Users\\defco\\OneDrive\\Escritorio\\Cursos\\Programación\\Cursados\\Data Science Bootcamp\\2503_dsft_thebridge_anderpena\\2-Data_Analysis\\8-BBDD\\SQL\\Practica\\1-Chinook'

In [9]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/chinook.db")

1. Obtén los clientes de brasil
2. Obtén los empleados que son agentes de ventas
3. Obtén las canciones de ‘AC/DC’
4. Obtén los campos de los clientes que no sean de USA: Nombre completo, ID, País
5. Obtén los empleados que son agentes de ventas: Nombre completo, Dirección
(Ciudad, Estado, País) y email
6. Obtén una lista con los países no repetidos a los que se han emitido facturas
7. Obtén una lista con los estados de USA no repetidos de donde son los clientes y
cuántos clientes en cada uno.
8. Cuántos artículos tiene la factura 37
9. Cuántas canciones tiene ‘AC/DC’
10. Cuántos artículos tiene cada factura
11. Cuántas facturas hay de cada país
12. Cuántas facturas ha habido en 2009 y 2011
13. Cuántas facturas ha habido entre 2009 y 2011
14. Cuántas clientes hay de España y de Brasil
15. Obtén las canciones que su título empieza por ‘You’

In [ ]:
# 1

query = """
SELECT * FROM CUSTOMERS AS C
WHERE C.Country = "Brazil"
"""

pd.read_sql_query(query, connection)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
2,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
3,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
4,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4

In [ ]:
# 2

query = """
SELECT * FROM EMPLOYEES AS E
WHERE E.Title = "Sales Support Agent"
"""

pd.read_sql_query(query, connection)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,3,Peacock,Jane,Sales Support Agent,2,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
1,4,Park,Margaret,Sales Support Agent,2,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
2,5,Johnson,Steve,Sales Support Agent,2,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [ ]:
# 3

query = """
SELECT * FROM TRACKS AS T
WHERE T.Composer = "AC/DC"
"""

pd.read_sql_query(query, connection)

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,15,Go Down,4,1,1,AC/DC,331180,10847611,0.99
1,16,Dog Eat Dog,4,1,1,AC/DC,215196,7032162,0.99
2,17,Let There Be Rock,4,1,1,AC/DC,366654,12021261,0.99
3,18,Bad Boy Boogie,4,1,1,AC/DC,267728,8776140,0.99
4,19,Problem Child,4,1,1,AC/DC,325041,10617116,0.99
5,20,Overdose,4,1,1,AC/DC,369319,12066294,0.99
6,21,Hell Ain't A Bad Place To Be,4,1,1,AC/DC,254380,8331286,0.99
7,22,Whole Lotta Rosie,4,1,1,AC/DC,323761,10547154,0.99

In [ ]:
# 4

query = """
SELECT C.FirstName, C.LastName, C.CustomerId, C.Country FROM CUSTOMERS AS C
WHERE C.Country != "USA"
"""

pd.read_sql_query(query, connection)

    FirstName      LastName  CustomerId         Country
0        Luís     Gonçalves           1          Brazil
1      Leonie        Köhler           2         Germany
2    François      Tremblay           3          Canada
3       Bjørn        Hansen           4          Norway
4   František   Wichterlová           5  Czech Republic
5      Helena          Holý           6  Czech Republic
6      Astrid        Gruber           7         Austria
7        Daan       Peeters           8         Belgium
8        Kara       Nielsen           9         Denmark
9     Eduardo       Martins          10          Brazil
10  Alexandre         Rocha          11          Brazil
11    Roberto       Almeida          12          Brazil
12   Fernanda         Ramos          13          Brazil
13       Mark       Philips          14          Canada
14   Jennifer      Peterson          15          Canada
15     Robert         Brown          29          Canada
16     Edward       Francis          30          Canada
17     Martha          Silk          31          Canada
18      Aaron      Mitchell          32          Canada
19      Ellie      Sullivan          33          Canada
20       João     Fernandes          34        Portugal
21   Madalena       Sampaio          35        Portugal
22     Hannah     Schneider          36         Germany
23       Fynn    Zimmermann          37         Germany
24     Niklas      Schröder          38         Germany
25    Camille       Bernard          39          France
26  Dominique      Lefebvre          40          France
27       Marc        Dubois          41          France
28      Wyatt        Girard          42          France
29   Isabelle       Mercier          43          France
30      Terhi    Hämäläinen          44         Finland
31   Ladislav        Kovács          45         Hungary
32       Hugh      O'Reilly          46         Ireland
33      Lucas       Mancini          47           Italy
34   Johannes  Van der Berg          48     Netherlands
35  Stanisław        Wójcik          49          Poland
36    Enrique         Muñoz          50           Spain
37     Joakim     Johansson          51          Sweden
38       Emma         Jones          52  United Kingdom
39       Phil        Hughes          53  United Kingdom
40      Steve        Murray          54  United Kingdom
41       Mark        Taylor          55       Australia
42      Diego     Gutiérrez          56       Argentina
43       Luis         Rojas          57           Chile
44      Manoj        Pareek          58           India
45       Puja    Srivastava          59           India

In [ ]:
# 5

query = """
SELECT E.FirstName, E.LastName, E.Address, E.Email FROM EMPLOYEES AS E
WHERE E.Title == "Sales Support Agent"
"""

pd.read_sql_query(query, connection)

  FirstName LastName           Address                     Email
0      Jane  Peacock     1111 6 Ave SW      jane@chinookcorp.com
1  Margaret     Park  683 10 Street SW  margaret@chinookcorp.com
2     Steve  Johnson      7727B 41 Ave     steve@chinookcorp.com

In [ ]:
# 6

query = """
SELECT I.BillingCountry FROM INVOICES AS I
GROUP BY I.BillingCountry
"""

pd.read_sql_query(query, connection)

    BillingCountry
0        Argentina
1        Australia
2          Austria
3          Belgium
4           Brazil
5           Canada
6            Chile
7   Czech Republic
8          Denmark
9          Finland
10          France
11         Germany
12         Hungary
13           India
14         Ireland
15           Italy
16     Netherlands
17          Norway
18          Poland
19        Portugal
20           Spain
21          Sweden
22             USA
23  United Kingdom

In [ ]:
# 7

query = """
SELECT C.State, COUNT(C.State) FROM CUSTOMERS AS C
WHERE C.Country = "USA"
GROUP BY C.State
"""

pd.read_sql_query(query, connection)

   State  COUNT(C.State)
0     AZ               1
1     CA               3
2     FL               1
3     IL               1
4     MA               1
5     NV               1
6     NY               1
7     TX               1
8     UT               1
9     WA               1
10    WI               1

In [ ]:
# 8

query = """
SELECT II.InvoiceId, COUNT(II.InvoiceId) FROM INVOICE_ITEMS AS II
WHERE II.InvoiceId = 37
"""

pd.read_sql_query(query, connection)

   InvoiceId  COUNT(II.InvoiceId)
0         37                    4

In [ ]:
# 9

query = """
SELECT COUNT(TrackId) FROM TRACKS AS T
WHERE T.Composer = "AC/DC"
"""

pd.read_sql_query(query, connection)

   COUNT(TrackId)
0               8

In [ ]:
# 10

query = """
SELECT II.InvoiceId, COUNT(II.InvoiceId) FROM INVOICE_ITEMS AS II
GROUP BY II.InvoiceId
"""

pd.read_sql_query(query, connection)

     InvoiceId  COUNT(II.InvoiceId)
0            1                    2
1            2                    4
2            3                    6
3            4                    9
4            5                   14
..         ...                  ...
407        408                    4
408        409                    6
409        410                    9
410        411                   14
411        412                    1

[412 rows x 2 columns]

In [ ]:
# 11

query = """
SELECT I.BillingCountry, COUNT(I.INVOICEID) FROM INVOICES AS I
GROUP BY I.BillingCountry
"""

pd.read_sql_query(query, connection)

    BillingCountry  COUNT(I.INVOICEID)
0        Argentina                   7
1        Australia                   7
2          Austria                   7
3          Belgium                   7
4           Brazil                  35
5           Canada                  56
6            Chile                   7
7   Czech Republic                  14
8          Denmark                   7
9          Finland                   7
10          France                  35
11         Germany                  28
12         Hungary                   7
13           India                  13
14         Ireland                   7
15           Italy                   7
16     Netherlands                   7
17          Norway                   7
18          Poland                   7
19        Portugal                  14
20           Spain                   7
21          Sweden                   7
22             USA                  91
23  United Kingdom                  21

In [ ]:
# 12

query = """
SELECT CAST(strftime('%Y', I.InvoiceDate) AS INT) AS YEAR, COUNT(I.InvoiceDate) FROM INVOICES AS I
WHERE YEAR = 2009 OR YEAR = 2011
GROUP BY YEAR
"""

pd.read_sql_query(query, connection)

   YEAR  COUNT(I.InvoiceDate)
0  2009                    83
1  2011                    83

In [ ]:
# 13

query = """
SELECT CAST(strftime('%Y', I.InvoiceDate) AS INT) AS YEAR, COUNT(I.InvoiceDate) FROM INVOICES AS I
WHERE YEAR = 2009 OR YEAR = 2011
GROUP BY YEAR
"""

pd.read_sql_query(query, connection)

   YEAR  COUNT(I.InvoiceDate)
0  2009                    83
1  2011                    83

In [ ]:
# 14

query = """
SELECT C.Country, COUNT(C.CustomerId) FROM CUSTOMERS AS C
WHERE C.Country = 'Spain' OR C.Country = 'Brazil'
GROUP BY C.Country
"""

pd.read_sql_query(query, connection)

  Country  COUNT(C.CustomerId)
0  Brazil                    5
1   Spain                    1

In [ ]:
# 15

query = """
SELECT T.Name FROM TRACKS AS T
WHERE T.Name LIKE 'You%'
"""

pd.read_sql_query(query, connection)

                                             Name
0                                 You Oughta Know
1                                       You Learn
2                     You Oughta Know (Alternate)
3                              Your Time Has Come
4                                    You Shook Me
5                                 You Shook Me(2)
6                                 You Fool No One
7             You Fool No One (Alternate Version)
8                              You Keep On Moving
9   You Can't Do it Right (With the One You Love)
10                                   You're Crazy
11                            You Ain't the First
12                              You Could Be Mine
13                You've Got Another Thing Comin'
14                                   You Shook Me
15                        Your Time Is Gonna Come
16                 You've Been A Long Time Coming
17   You're What's Happening (In The World Today)
18                          You Sure Love To Ball
19                                 Your Blue Room
20                                        You Are
21                          You're My Best Friend
22                         You Are The Everything
23                                  You've Got It
24                                    Your Mirror
25                             You Got Me Rocking
26                             You Got Me Rocking
27                             You Better You Bet
28                              You Really Got Me
29                               You Got No Right
30               You're Gonna Break My Hart Again
31                        Your Time Is Gonna Come
32                                    Your Savior
33                                Your Soul Today
34                               You Know My Name
35                           You Know I'm No Good
36  You Know I'm No Good (feat. Ghostface Killah)
37                    You Sent Me Flying / Cherry

1. Facturas de Clientes de Brasil, Nombre del cliente, Id de factura, fecha de la
factura y el país de la factura
2. Obtén cada factura asociada a cada agente de ventas con su nombre completo
3. Obtén el nombre del cliente, el país, el nombre del agente y el total
4. Obtén cada artículo de la factura con el nombre de la canción
5. Muestra todas las canciones con su nombre, formato, álbum y género
6. Cuántas canciones hay en cada playlist
7. Cuánto ha vendido cada empleado
8. ¿Quién ha sido el agente de ventas que más ha vendido en 2009?
9. ¿Cuáles son los 3 grupos que más han vendido?

In [ ]:
# 1

query = """
SELECT c.FirstName || ' ' || c.LastName AS CustomerName, i.InvoiceId, i.InvoiceDate, i.BillingCountry
FROM customers c
JOIN invoices i ON c.CustomerId = i.CustomerId
WHERE i.BillingCountry = 'Brazil';
"""

pd.read_sql_query(query, connection)

       CustomerName  InvoiceId          InvoiceDate BillingCountry
0   Eduardo Martins         25  2009-04-09 00:00:00         Brazil
1   Roberto Almeida         34  2009-05-23 00:00:00         Brazil
2    Fernanda Ramos         35  2009-06-05 00:00:00         Brazil
3   Alexandre Rocha         57  2009-09-06 00:00:00         Brazil
4    Fernanda Ramos         58  2009-09-07 00:00:00         Brazil
5   Alexandre Rocha         68  2009-10-17 00:00:00         Brazil
6    Fernanda Ramos         80  2009-12-10 00:00:00         Brazil
7    Luís Gonçalves         98  2010-03-11 00:00:00         Brazil
8    Luís Gonçalves        121  2010-06-13 00:00:00         Brazil
9   Alexandre Rocha        123  2010-06-17 00:00:00         Brazil
10   Fernanda Ramos        132  2010-07-31 00:00:00         Brazil
11   Luís Gonçalves        143  2010-09-15 00:00:00         Brazil
12  Eduardo Martins        154  2010-11-14 00:00:00         Brazil
13  Roberto Almeida        155  2010-11-14 00:00:00         Brazil
14  Roberto Almeida        166  2010-12-25 00:00:00         Brazil
15  Eduardo Martins        177  2011-02-16 00:00:00         Brazil
16   Luís Gonçalves        195  2011-05-06 00:00:00         Brazil
17  Eduardo Martins        199  2011-05-21 00:00:00         Brazil
18  Roberto Almeida        221  2011-08-25 00:00:00         Brazil
19  Eduardo Martins        251  2012-01-09 00:00:00         Brazil
20  Alexandre Rocha        252  2012-01-22 00:00:00         Brazil
21   Fernanda Ramos        253  2012-01-22 00:00:00         Brazil
22   Fernanda Ramos        264  2012-03-03 00:00:00         Brazil
23  Alexandre Rocha        275  2012-04-25 00:00:00         Brazil
24  Alexandre Rocha        297  2012-07-28 00:00:00         Brazil
25   Luís Gonçalves        316  2012-10-27 00:00:00         Brazil
26   Fernanda Ramos        319  2012-11-01 00:00:00         Brazil
27   Luís Gonçalves        327  2012-12-07 00:00:00         Brazil
28  Alexandre Rocha        349  2013-03-18 00:00:00         Brazil
29  Roberto Almeida        350  2013-03-31 00:00:00         Brazil
30  Eduardo Martins        372  2013-07-02 00:00:00         Brazil
31  Roberto Almeida        373  2013-07-03 00:00:00         Brazil
32   Luís Gonçalves        382  2013-08-07 00:00:00         Brazil
33  Eduardo Martins        383  2013-08-12 00:00:00         Brazil
34  Roberto Almeida        395  2013-10-05 00:00:00         Brazil

In [ ]:
# 2

query = """
SELECT e.FirstName || ' ' || e.LastName AS SalesAgent, i.InvoiceId FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId;
"""

pd.read_sql_query(query, connection)

        SALESAGENT  InvoiceId
0     Jane Peacock         98
1     Jane Peacock        121
2     Jane Peacock        143
3     Jane Peacock        195
4     Jane Peacock        316
..             ...        ...
407  Steve Johnson         88
408  Steve Johnson        217
409  Steve Johnson        240
410  Steve Johnson        262
411  Steve Johnson        314

[412 rows x 2 columns]

In [30]:
# 3

query = """
SELECT c.FirstName || ' ' || c.LastName AS CustomerName, c.Country, e.FirstName || ' ' || e.LastName AS SalesAgent, i.Total
FROM customers c
JOIN employees e ON c.SupportRepId = e.EmployeeId
JOIN invoices i ON c.CustomerId = i.CustomerId;
"""

pd.read_sql_query(query, connection)

        CustomerName Country    SalesAgent  Total
0     Luís Gonçalves  Brazil  Jane Peacock   3.98
1     Luís Gonçalves  Brazil  Jane Peacock   3.96
2     Luís Gonçalves  Brazil  Jane Peacock   5.94
3     Luís Gonçalves  Brazil  Jane Peacock   0.99
4     Luís Gonçalves  Brazil  Jane Peacock   1.98
..               ...     ...           ...    ...
407  Puja Srivastava   India  Jane Peacock   5.94
408  Puja Srivastava   India  Jane Peacock   1.99
409  Puja Srivastava   India  Jane Peacock   1.98
410  Puja Srivastava   India  Jane Peacock  13.86
411  Puja Srivastava   India  Jane Peacock   8.91

[412 rows x 4 columns]

In [ ]:
# 4

query = """
SELECT ii.invoiceid, t.name AS TrackName FROM invoice_items AS ii
JOIN tracks t ON ii.TrackId = t.TrackId;
"""

pd.read_sql_query(query, connection)

      InvoiceId                                          TrackName
0             1                                  Balls to the Wall
1             1                                  Restless and Wild
2             2                              Put The Finger On You
3             2                                   Inject The Venom
4             2                                         Evil Walks
...         ...                                                ...
2235        411                                   Looking For Love
2236        411                                    Sweet Lady Luck
2237        411  Feirinha da Pavuna/Luz do Repente/Bagaço da La...
2238        411                                   Samba pras moças
2239        412                                           Hot Girl

[2240 rows x 2 columns]

In [33]:
# 5

query = """
SELECT t.Name AS TrackName, mt.Name AS MediaType, a.Title AS Album, g.Name AS Genre FROM tracks t
JOIN media_types mt ON t.MediaTypeId = mt.MediaTypeId
JOIN albums a ON t.AlbumId = a.AlbumId
JOIN genres g ON t.GenreId = g.GenreId;
"""

pd.read_sql_query(query, connection)

,TrackName,MediaType,Album,Genre
0,For Those About To Rock (We Salute You),MPEG audio file,For Those About To Rock We Salute You,Rock
1,Balls to the Wall,Protected AAC audio file,Balls to the Wall,Rock
2,Fast As a Shark,Protected AAC audio file,Restless and Wild,Rock
3,Restless and Wild,Protected AAC audio file,Restless and Wild,Rock
4,Princess of the Dawn,Protected AAC audio file,Restless and Wild,Rock
...,...,...,...,...
3498,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,Protected AAC audio file,Respighi:Pines of Rome,Classical
3499,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",Protected AAC audio file,Schubert: The Late String Quartets & String Qu...,Classical
3500,"L'orfeo, Act 3, Sinfonia (Orchestra)",Protected AAC audio file,Monteverdi: L'Orfeo,Classical
3501,"Quintet for Horn, Violin, 2 Violas, and Cello ...",Protected AAC audio file,Mozart: Chamber Music,Classical
3502,"Die Zauberflöte, K.620: ""Der Hölle Rache Kocht...",Protected AAC audio file,Mozart Gala: Famous Arias,Opera

In [34]:
# 6

query = """
SELECT p.Name AS Playlist, COUNT(pt.TrackId) FROM playlists AS p
JOIN playlist_track AS pt ON p.PlaylistId = pt.PlaylistId
GROUP BY p.Name
"""

pd.read_sql_query(query, connection)

                      Playlist  COUNT(pt.TrackId)
0                   90’s Music               1477
1              Brazilian Music                 39
2                    Classical                 75
3    Classical 101 - Deep Cuts                 25
4   Classical 101 - Next Steps                 25
5   Classical 101 - The Basics                 25
6                       Grunge                 15
7          Heavy Metal Classic                 26
8                        Music               6580
9                 Music Videos                  1
10                 On-The-Go 1                  1
11                    TV Shows                426

In [35]:
# 7

query = """
SELECT e.FirstName || ' ' || e.LastName AS SalesAgent, SUM(i.Total) AS TotalSales FROM employees e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
GROUP BY e.EmployeeId
"""

pd.read_sql_query(query, connection)

      SalesAgent  TotalSales
0   Jane Peacock      833.04
1  Margaret Park      775.40
2  Steve Johnson      720.16

In [ ]:
# 8

query = """
SELECT e.FirstName || ' ' || e.LastName AS SalesAgent, SUM(i.Total) AS TotalSales FROM employees AS e
JOIN customers c ON e.EmployeeId = c.SupportRepId
JOIN invoices i ON c.CustomerId = i.CustomerId
GROUP BY e.EmployeeId
ORDER BY TotalSales DESC
LIMIT 1;
"""

pd.read_sql_query(query, connection)

     SalesAgent  TotalSales
0  Jane Peacock      833.04

In [ ]:
# 9

query = """
SELECT ar.Name AS ArtistName, SUM(ii.Quantity) AS TotalRevenue FROM invoice_items ii
JOIN tracks t ON ii.TrackId = t.TrackId
JOIN albums a ON t.AlbumId = a.AlbumId
JOIN artists ar ON a.ArtistId = ar.ArtistId
GROUP BY ar.ArtistId
ORDER BY TotalRevenue DESC
LIMIT 3;
"""

pd.read_sql_query(query, connection)

    ArtistName  TotalRevenue
0  Iron Maiden           140
1           U2           107
2    Metallica            91